Курсы1/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ПродажаТовара</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курсы1/src/AccumulationRegisters/ОстаткиТовара/ОстаткиТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТовара</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Курсы1/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивОшибок = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		МассивОшибок.Добавить("Филиал не можен быть пустым");
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить(СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("Автор");
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиРаспровести()
	
	Если Не ПроверитьЗаполнение() ТОгда
		Возврат;
	КонецЕсли;
	ПровестираспровестинаСервере();
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.ОстаткиТовара.Очистить();
	
	Движения.ПродажаТовара.Записывать = Истина;
	Движения.ПродажаТовара.Очистить();
	
	Движения.Записать();
	
	
	
	Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ТекСтрокаНоменклатура.Номенклатура);
		Отбор.Вставить("Филиал",Филиал);
		
		ТаблицаОстаткиПоТовару = РегистрыНакопления.ОстаткиТовара.Остатки(МоментВремени(),Отбор);
		Если ТаблицаОстаткиПоТовару.Количество() > 0 И ТаблицаОстаткиПоТовару[0].Количество >= ТекСтрокаНоменклатура.Количество Тогда
			НоваяСтрокаОстатки = Движения.ОстаткиТовара.Добавить();
			НоваяСтрокаОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрокаОстатки.Период = Дата;
			НоваяСтрокаОстатки.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
			НоваяСтрокаОстатки.Филиал = Филиал; 
			НоваяСтрокаОстатки.Количество = ТекСтрокаНоменклатура.Количество;
			НоваяСтрокаОстатки.Сумма = ?(ТаблицаОстаткиПоТовару[0].Количество = ТекСтрокаНоменклатура.Количество, 
			ТаблицаОстаткиПоТовару[0].Сумма,
			ТаблицаОстаткиПоТовару[0].Сумма/ТаблицаОстаткиПоТовару[0].Количество*ТекСтрокаНоменклатура.Количество);
			
			НоваяЗаписьПродажи = Движения.ПродажаТовара.Добавить();
			НоваяЗаписьПродажи.Период = Дата;
			НоваяЗаписьПродажи.Номенклатура = ТекСтрокаНоменклатура.Номенклатура; 
			НоваяЗаписьПродажи.Филиал = Филиал;
			НоваяЗаписьПродажи.Количество = ТекСтрокаНоменклатура.Количество;
			НоваяЗаписьПродажи.СуммаПродажи = ТекСтрокаНоменклатура.Сумма;
			НоваяЗаписьПродажи.Себестоимость = НоваяСтрокаОстатки.Сумма;
			НоваяЗаписьПродажи.СостояниеТовараПриПродаже = Перечисления.СостояниеТовараПриПродаже.ПустаяСсылка();
			
		Иначе
			Сообщить(СтрШаблон("Недостаточно товара %1", ТекСтрокаНоменклатура.Номенклатура));
			Отказ = Истина;
			Возврат
		КонецЕсли;
	КонецЦикла;
		
	Движения.ОстаткиТовара.Записывать = Истина;
    Движения.ПродажаТовара.Записывать = Истина;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
